TestEDT/src/Enums/уа_ТипыЦенныхБумагБР/уа_ТипыЦенныхБумагБР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ТипыЦенныхБумагБР</name>
  <enumValues>
    <name>BON1</name>
  </enumValues>
  <enumValues>
    <name>BON2</name>
  </enumValues>
  <enumValues>
    <name>BON3</name>
  </enumValues>
  <enumValues>
    <name>BON4</name>
  </enumValues>
  <enumValues>
    <name>BON5</name>
  </enumValues>
  <enumValues>
    <name>BON6</name>
  </enumValues>
  <enumValues>
    <name>BON7</name>
  </enumValues>
  <enumValues>
    <name>DS1</name>
  </enumValues>
  <enumValues>
    <name>DS2</name>
  </enumValues>
  <enumValues>
    <name>SHS1</name>
  </enumValues>
  <enumValues>
    <name>SHS2</name>
  </enumValues>
  <enumValues>
    <name>SHS3</name>
  </enumValues>
  <enumValues>
    <name>SHS4</name>
  </enumValues>
  <enumValues>
    <name>SHS5</name>
  </enumValues>
  <enumValues>
    <name>SHS6</name>
  </enumValues>
  <enumValues>
    <name>SHS7</name>
  </enumValues>
  <enumValues>
    <name>SHS8</name>
  </enumValues>
  <enumValues>
    <name>DR</name>
  </enumValues>
  <enumValues>
    <name>CON</name>
  </enumValues>
  <enumValues>
    <name>WTS</name>
  </enumValues>
  <enumValues>
    <name>OPNI</name>
  </enumValues>
  <enumValues>
    <name>ENC</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_ТипыЦенныхБумагБР/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НайтиПоКоду(Идентификатор) Экспорт
	ТипЦББР = Неопределено;
	Если Идентификатор = "BON1" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON1;
	ИначеЕсли Идентификатор = "BON2" Тогда
		ТипЦББР	= Перечисления.уа_ТипыЦенныхБумагБР.BON2;
	ИначеЕсли Идентификатор = "BON3" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON3;
	ИначеЕсли Идентификатор = "BON4" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON4;
	ИначеЕсли Идентификатор = "BON5" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON5;
	ИначеЕсли Идентификатор = "BON6" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON6;
	ИначеЕсли Идентификатор = "BON7" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON7;
	ИначеЕсли Идентификатор = "DS1" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.DS1;
	ИначеЕсли Идентификатор = "DS2" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.DS2;
	ИначеЕсли Идентификатор = "SHS1" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS1;
	ИначеЕсли Идентификатор = "SHS2" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS2;
	ИначеЕсли Идентификатор = "SHS3" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS3;
	ИначеЕсли Идентификатор = "SHS4" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS4;
	ИначеЕсли Идентификатор = "SHS5" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS5;
	ИначеЕсли Идентификатор = "SHS6" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS6;
	ИначеЕсли Идентификатор = "SHS7" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS7;
	ИначеЕсли Идентификатор = "SHS8" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS8;
	ИначеЕсли Идентификатор = "DR" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.DR;
	ИначеЕсли Идентификатор = "CON" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.CON;
	ИначеЕсли Идентификатор = "WTS" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.WTS;
	ИначеЕсли Идентификатор = "OPNI" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.OPNI;
	ИначеЕсли Идентификатор = "ENC" Тогда
		ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.ENC;
	КонецЕсли; 
	
	Возврат ТипЦББР;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
